my_list = ["apple", "pear", "orange", "peach", "cherry", "apricot"]
print(my_list)  # вывод списка
print(my_list[0], my_list[-1])  # вывод первого элемента и последнего элемента списка
print(my_list[2:4])  # вывод с третьего элемента до пятого элемента (не включая пятый), инд 2, 3
print(my_list[2:5])  # вывод с третьего элемента до пятого элемента (включая пятый), инд 2, 3, 4
my_list[2] = "coconut"  # изменение значения третьего элемента списка, инд 2
print(my_list)  # вывод списка
print()

my_dict = {"apple": "яблоко", "orange": "апельсин", "cherry": "слива"}
print(my_dict)  # вывод словаря
print(my_dict["orange"])  # вывод значения заданного ключа
my_dict["cherry"] = "вишня"  # изменение значения заданного ключа
my_dict["apricot"] = "абрикос"  # добавление новой пары, если заданный ключ не существует
print(my_dict)  # вывод словаря
