print('''Красный, синий и желтый называются основными цветами, потому что их нельзя получить путем смешения других цветов.
         При смешивании двух основных цветов получается вторичный цвет:
         -если смешать красный и синий, то получится фиолетовый;
         -если смешать красный и желтый, то получится оранжевый;
         -если смешать синий и желтый, то получится зеленый.
         Программа определяет цвет, который получается при смешивании двух основных цветов''')

print('введите два цвета из трех: красный, синий, желтый')
cl_1 = input('первый цвет:')
cl_2 = input('второй цвет:')

print('введены цвета:', cl_1, cl_2)

rd = 'красный'
bl = 'синий'
ye = 'желтый'

if (cl_1 != rd and cl_1 != bl and cl_1 != ye and cl_2 != rd and cl_2 != bl and cl_2 != ye) or (cl_1 == cl_2):
    print('ошибка')
else:
    if (cl_1 == rd and cl_2 == bl) or (cl_2 == rd and cl_1 == bl):
        print('результирующий цвет: фиолетовый')
    if (cl_1 == rd and cl_2 == ye) or (cl_2 == rd and cl_1 == ye):
        print('результирующий цвет: оранжевый')
    if (cl_1 == ye and cl_2 == bl) or (cl_2 == ye and cl_1 == bl):
        print('результирующий цвет: зеленый')
