'''
На вход программе подается натуральное число 𝑛.
Напишите программу, которая выводит звездный треугольник в соответствии с примером.
n = 3

***
**
*

'''

n = int(input('Введите натуральное число:'))

for i in range(n):
    for j in range(n-i):
        print('*', end='')
    print()