'''
Напишите программу, на вход которой даются четыре числа a, b, c, d
Программа должна вывести фрагмент таблицы умножения для всех чисел отрезка [a;b] на все числа отрезка [c;d].
Числа a, b, c и d являются натуральными и не превосходят 10, a≤b, c≤d.
Следуйте формату вывода из примера, для разделения элементов внутри строки используйте '\t' — символ табуляции.
Заметьте, что левым столбцом и верхней строкой выводятся сами числа из заданных отрезков —
заголовочные столбец и строка таблицы.

a,b,c,d = 7,10,5,6

    5   6
7   35  42
8   40  48
9   45  54
10  50  60

'''

# a, b, c, d = map(int, input('введите интервалы через пробел').split())
a, b, c, d = 7, 10, 5, 6

if (a, b, c, d < 10) or (a <= b) or (c <= d):
    print('', end='\t')
    for i in range(c, d + 1):
        print(i, end='\t')
    print('')
    for j in range(a, b + 1):
        print(j, end='\t')
        for k in range(c, d + 1):
            print(j * k, end='\t')
        print('')