'''
Дано натуральное число 𝑛.
Напишите программу, которая печатает численный треугольник с высотой равной n, в соответствии с примером:

n = 6

1
2 3
4 5 6
7 8 9 10
11 12 13 14 15
16 17 18 19 20 21

'''

n = int(input('Введите натуральное число:'))

zif = 0
for i in range(n+1):
    for j in range(i):
        zif += 1
        print(zif, end=' ')
    print()
